using UnityEngine;
using System.Collections;
using UnityEngine.UI;
using System.Text.RegularExpressions;

public class TeamNamePopup : MonoBehaviour {

    public Text _inputTextField;
    public Text _inputField;
    public tk2dSlicedSprite iconX;
    public tk2dSlicedSprite iconCheck;

    private TouchScreenKeyboard _keyboard;

    public System.Action _callback;

    bool isTextCount = false;
    int _textCount = 0;
    string _textString;

    string _pastString = string.Empty;

    public string BanName;
    public void Init(System.Action callback = null)
    {
        _callback = callback;
        _textCount = 0;
        iconX.gameObject.SetActive( true );
        iconCheck.gameObject.SetActive( false );
        transform.localPosition = new Vector3( 0, 0, -500f );
    }

    void Update()
    {
        _textString = _inputTextField.text;

        if (CheckValidName(_textString) == false)
        {
            iconCheck.gameObject.SetActive( false );
            iconX.gameObject.SetActive( true );
        } else
        {
            iconCheck.gameObject.SetActive( true );
            iconX.gameObject.SetActive( false );
        }
        if( _pastString.Equals( _inputField.text ) == false )
        {
            _pastString = _inputField.text;
            string tx = _inputField.text; 
            string keyName = string.Empty;
            for( int i = 0; i < tx.Length; i++ )
            {
                if( ( '0' <= tx[i] && '9' >= tx[i] ) ||
                    ( 'a' <= tx[i] && 'z' >= tx[i] ) ||
                    ( 'A' <= tx[i] && 'Z' >= tx[i] ) ||
                    ( '가' <= tx[i] && '힣' >= tx[i] ) )
                {
                    keyName = string.Format( "{0}{1}", keyName, tx[i] );
                }
            }

            if( null != _inputTextField )
                _inputTextField.text = keyName;
        }
    }

    bool CheckValidName(string textName)
    {
        if (textName.Length < 2 || textName.Length > 8)
            return false;

        //Issue 5 - 한글 완성형 문제: 완성형이 아닌 캐릭터가 매칭이 되면 false를 리턴한다. 한글과 영문 조합은 현재로서는 가능하다. (2016-05-23)
        //위의 업데이트 문에서 _pastString처리로 완성형 체크를 하는 것 같은데, RegEx로 처리를 하면 좀 더 나을듯 하다.
        var rex = new Regex(@"[ㄱ-ㅎㅏ-ㅣ]");
        if (rex.IsMatch(textName))
            return false;

        return true;
    }

    public void SetTeamNameField()
    {
        _keyboard = TouchScreenKeyboard.Open( "", TouchScreenKeyboardType.Default, false, false, false );
    }

    public void OnClickConfirm()
    {
        //UIManager.instance.OpenPopup( E_UIPOPUP_TYPE.CheckPopup ).GetComponent<CheckPopup>().SetCheckPopupDesc( E_CHECK_POPUP_TYPE.Confirm, "너의 이름", _inputTextField.text );

       BanName = "1818,10댕,10발,10새,10색,10섹,10쉑,10알,10창,10챵,10팍,10팔,10펄,10할,18,18nom,18너미,18넘,18년,18놈,18뇬,18늠,18새,18새끼,18색,18색끼,18색히,18세끼,18세캬,18쉐키,18아,18자식,4kkasi,4까시,beheading,bitch,BL,BOGY,boji,BOJY,BOZI,bozy,byuntae,C8,carsex,ccibal,ccipal,ccival,celina,cibal,cipal,cival,condom,crazy,cunnus,devil,dildo,dork,duke,ecstasy,elija,enterchannel,ero,Father Fucker,fetish,fuck,Fucker,Fucking,Fuckyou,gamemaster,GM,gotdamn,gotohell,gusaoao,gusrjfo,gusrma,hardcore,HardcorePorno,hentai,holy,IJSEX,jach,jaji,jamji,jasal,jawe,jawi,jazi,jazy,jiral,jot,kissmyass,lene,lora,lorita,lottery,MANABOZI,mare,Molca,Molcanara,Molcaparty,motherfucker,Mulyosex,NeNe,nigimi,Nimi,nom,nomo,nood,nopants,nude,nymphomane,oral,orgasms,penis,pennis,perineum,pervert,petish,phonesex,playbog,playboy,playbozi,PleyboG,pleyboy,ponsec,ponsek,porn,porner,porno,prno,pussy,rjfo,rogue,Sans,Satan,scrotum,sex,shoo,shutup,sibal,sipal,siutty,sival,slut,slutty,ssibal,ssibbal,ssival,SticandY,suck,sucks,SWAPING,testis,tprtm,Viper,virgin,vulva,warez,wiseman,Yahanbozi,yasine,zaji,zasal,zazi,zot,zotte,zungyang,z랄,가슴,가슴만져,가슴빨아,가슴빨어,가슴조물락,가슴주물럭,가슴쪼물딱,가슴쪼물락,가슴핧아,가슴핧어,가튼년,갈보,강간,강빨,같은년,개10,개가튼,개갈보,개갖,개같,개같은,개걸래,개걸레,개겨라,개겨봐라,개그지,개그츼,개기다,개나발,개냔,개너마,개넘,개녀나,개년,개녆,개노무,개놈,개뇨,개뇬,개뇽,개눔,개뉨,개뉸,개늠,개늬,개떨마니,개라석,개라슥,개래,개랴,개레,개망나니,개망신,개밥,개밥될,개뱡,개뱡신,개벽,개벽다귀,개변태,개병신,개보쥐,개보지,개보지들아,개뵹신,개부랄,개불랄,개불쌍한놈,개불알,개붕알,개빅디구,개빙신,개빙신같은새키들,개빤,개뼉,개사쿠리,개삽,개상,개상놈,개새,개새끼,개색,개샊,개샌,개샏,개샙,개샛,개샠,개샤,개샼,개섀,개세,개섹,개섹꺄,개섺,개섻,개셐,개소,개소리,개솻,개쇄,개쇅,개쇗,개숩,개쉐,개쉑,개쉣,개쉨,개쉬,개쉬바,개쉬발,개쉬벌,개쉬캬,개쉭,개슷,개시기,개시끼,개시바,개시발,개시키,개식,개십,개십새,개십세,개싸,개쌍,개쌍넘,개쌍년,개쌍놈,개쌍뇬,개쌕기,개쌤,개쌥,개쌬기,개쌰끼,개썅,개썈,개썌끼,개썍,개썎,개쎄,개쎄끼야,개쎜,개쎜키,개쒜,개쓉,개쓰,개쓰레기,개쓰렉,개씨,개씨바,개씨발,개씨벌,개씨블,개씨뻘,개씨펄,개씩,개씹,개씹세,개씹팔년아,개악티다,개애,개염병,개자,개자식,개자쥐,개자지,개잡,개잡년,개잡지랄,개쟈,개적,개전,개젆,개젓,개젓가튼넘,개젖,개젗,개젙,개젿,개졋,개졎,개조,개조또,개조옷,개족,개좃,개좄,개좆,개좇,개좌,개죠,개죷,개주둥아리,개즤,개지랄,개지럃,개지롤,개지뢀,개질,개짜슥,개쪽바리,개찌랄,개찌질,개허러,개호러,개호로,갬머니,갱겨대다,갱기다,걔늠,걔샊,걔샼,걔쉾,걔자,거기나빨아랑,거기를혀로할타,거기커,거세,거시기,거지같은년,거지같은놈,걸래,걸래가튼뇬,걸래같은년,걸래년,걸래뇬,걸레,겁대가리,겁대갏,겁탈,게가튼,게같은,게넘,게년,게놈,게뇬,게뇽,게눔,게보쥐,게보지,게부럴,게새끼,게새리,게색,게세,게세끼,게세야,게세캬,게세키,게섹,게시기,게시끼,게쌍,게쌔,게썅,게쎄기,게쎄끼,게쎼,게이,게임마스터,게자식,게자쥐,게자지,게젓,게좆,게지랄,게후진,겜머니,계년,고자,고추,고환,골빈년,골빈놈,과슴,관녀니,광간,광년,광뇬,괘뇬,구녕,굿보지,귀두,그룹섹,그룹섹스,그지년,그지랄이냐,그지쇅키,그지쇗꺄,그지쇗끼,근친상간,깔,깔식,깝떨면서,깝치,깽자지,꺼렁뱅이,꺼저,꺼져,껃여,껒여,께색,꼬봉,꼬붕,꼬추,꼴값,꼴깝,꼴리나,꼴리냐,꼴리다,꼴리면,꼴린다,꼴림,꼴받네,꼴받아,꼴받치는,꼴통,나가쳐죽지,나랑함할래,나쁜넘,나쁜년,나체,난교,난자,남창,내꺼빨아,내꺼핧아,내미랄,내버지,내보지,내씨발,내자지,내잠지,내조지,너거애비,너거어마이,너그어미,넣다뺏다,년,녛아,녜미,노브라,노숙자,노인네,노팬티,놈,뇬,누드,눈까,눈까러,눈까뤼,눈까리,눈깔,눈깔어,눈깛,눈꾸녕,뉘뮈,뉘미,뉘미럴,느그애미,느그애비,느그엄마,느그에미,느그에비,느금마,느금미,느기미,늬기미,늬미,니기미,니끼미,니내애미,니믜,니미,니미랄,니미럴,니미밑구녕,니미쉬벌,니미시,니미쒸발,니미쒸블,니미씨,니미좃,니보지,니보지구멍,니뽕좃이다,니뿡,니아범,니애미,니애비,니앰이,니어미,니어미배째,니엄마,니에미,니에비,니온,니이미,니자지,니조개,니조게,니좃,니좃대로,니좆,니죠때,니할애비,닌자년,닝기,닝기리,닝기미,닝기미씹,닝기미좃,다구,닥대가리,닥대갈,닥대구빡,닥두,닥처,닥쳐,닥쳐병신아,닥초,닥쵸,닥치,닦처,닦쳐,닦초,닦쵸,닦춰,닦치,닭대가리,닭대갈,닭데갈,닭두,닭뒈가리,닭뚜,닭머리,닭쳐,닭쵸,닭취구,닭털보지,닭퉁,대가뤼,대가리,대갈,대갈빡,대갈통,대걀빡,대과리,대구박,대구빡,대깔박,대깔빡,대끼놈,대저라,대저써,대져,대주까,대줄께,대줄년,대질라,대질래,대질레,대짜로,댁알통,더까대라,덩신,덩침,데가뤼,데가리,데갈,데갈텅,데갈통,데구빡,데저라,데져,데져라,데질레,뎅신,도둑년,도둑놈,도라이,도촬,돌대가,돌대가릐,돌대가리,돌림빵,돌마니,돌머리,돌아이,돌았나,돌으년,돌은넘,돌은년,돌은놈,돌은새끼,돗같애,동인지,돡쳐,되질래,되질레,둥신,뒈가리,뒈져,뒈져라,뒈지,뒈지고,뒈지다,뒈진,뒈진다,뒈질,뒈질라,뒈질래,뒈질레,뒈질려,뒈찐,뒈찐다,뒤랄,뒤럴,뒤싸질놈,뒤여질놈,뒤저라,뒤져,뒤져야돼,뒤지,뒤지다,뒤진,뒤진다,뒤질,뒤질뇬아,뒤질라고,뒤질래,뒤짐,뒤치기,뒷대갈,뒷대갈빡,뒹시,뒹신,듁거싀포,드러뇬,드러운놈,드러운뇬,드러운새리,드런뇬,드륺,드응신,등쉬,등쉰,등시,등신,등쳐먹고,듸랄,듸러븐놈,듸저,듸저라,듸지,듸지게,듸질,듸질놈,디랄,디람,디랼,디럴,디롤,디미,디저라,디져,디져라,디지다,디진다,디질,디질껴,디질래,디질레,디치기,딜도,딜방,딜빵,딩쉰,딩시,따까리,따먹고,따먹기,따먹다,따먹어,따무라,따묵기,딸녀,딸따뤼,딸따리,딸딸,딸딸이,딸순이,딸치냐,때갈,떠라이,떡걸,떡촌,떡치기,떨거지,떨마니,떨아이,또라이,똘갱이,똘빵,똘아이,똘추,똘추새끼,똥강아지,똥같은,똥걸래,똥고,똥구녁,똥구녕,똥구멍,똥구멍나사,똥꼬,똥꾸,똥꾸녕,똥꾸멍,똥냄새,똥밟고,똴똴이,뚀라이,뚝을,뚱녀방,뚱뗑,뚱보시끼,뚱보시키,뚱보씨끼,뛰발,뛰벌,뜨발,뜨벌,뜨블,띌빵,띠껍냐,띠댕,띠뎅,띠바,띠박,띠발,띠밝,띠밝뇽,띠방,띠뱅이,띠버럴,띠벌,띠벙세,띠벵이,띠병할,띠볼,띠봉,띠부댕,띠부랄,띠부렐,띠불,띠붕,띠브럴,띠블,띠비랄,띠이발,띠이방,띠이벌,띠이볼,띠이불,띠이붕,띠이팔,띠이펄,띠이풀,띠팔,띠펄,띠풀,띱떄,띱세,띱쒜,래즈비언,래지,러브링,레즈,레즈년,레즈비언,레지,로리타,룸섹스,립서비스,마스터베이션,마약,마조히스트,마조히즘,막간년,막대쑤셔줘,막대핧아줘,말버지,말보지,말자지,말조지,말좆,맛간년,맛없는년,망할,망할넘,망할년,망할놈,망할뇬,망할련,맞아죽을놈,매춘,매친뇬,머니매매,머니팜,머니팝,머니팝니다,머저리,멍청한년,멍청한놈,메칀,메친,메틴넘,멜돔,모가지,모니터링,모르핀,몰카,몸파는,몸파라,문디,뭉개버릴년,뮈칀세끼,뮈칀세리,뮈칀세이,뮈칀섹끼,뮈친세리,뮈친세이,뮈친섹끼,뮈친쉑이,믜칀,믜칂,믜칞,믜틘,믳칀,미씨촌,미이친뇬,미창뇬,미천년,미쳤냐,미촌놈,미쵼,미추니년,미췐,미췒,미췒뇽,미췔,미췬,미췬년,미췬세끼,미췽,미칀,미칂,미치놈,미치새기,미치인넘,미치인년,미치인놈,미치인뇬,미친,미친개새끼,미친개색기,미친개쉑,미친개잡년,미친년,미친놈,미친새끼,미친섹까,미친싸앙년,미친싸앙놈,미친쌍농,미친쌍뇽,미친썅년,미친썅놈,미친씹쌔,미친씹쌔끼,미친씹쎄끼,미친좃대가리,미칞,미칞냔,미침,미칫그지샛킈,미칫년,미칫뇬,미칭년,미칭세기,미칭세키,미퉌년,미튄,미틘,미티넘,미틴,미틴놈,미핀놈,민증위조,밇췬녕,밋친년,밑구녕,밑구멍,바가,바보새끼,바보색기,바이브레이터,박아줄게,박아줄께,반병신,발기,발넘,발년,발색,발섹,발섹이야,발정,배앵신,백보지,밴쉰,뱃놈,뱅쉰,뱅싄,뱅시,뱅신,뱅신시키,뱅씮,뱡신,버랄,버러지,버럴,버영쉔,버쥐,버즤,버지,버지물,버짓물,버큐,벅큐,번색,번섹,번쌕,벌년,벌리,벌리고꼿고,벌창,벗어,벙닭,벙딱,벙색,벙섹,벙신,벙알,벵쉬,벵싀,벵신,벼엉,벼엉쉬나,벼엉쉰,벼엉시나,벼엉시이,벼엉신,벼잉신,변녀,변섹,변태,별뉨,병 신,병년,병닥,병닭,병따,병딱,병띤,병삼,병쉔,병쉬,병쉰,병싀,병싄,병싄아,병싆,병시,병신,병신새,병신쉐리,병신쉐이,병쒼,병씬,병씮,병어신,병엉신,보뒤,보랄,보럴,보오즤,보오즤년,보오지,보쥐,보쥐털,보즤,보지,보지구녕,보지뇬,보짓,보짓년,보짓물,보짖물,보털,본디지,봇털,봉신,봉알,봉왈,봉지다,봏지,뵝신,뵤오지,뵤쥐,뵤즤,뵤지,뵨태,뵹년,뵹띤,뵹삼,뵹쉰,뵹시,뵹신,뵿지,부랄,부럴,부롤,부뢀,부부교환,부카케,불륜,불알,불앓,불얼,불할,붏앓,붕뛴,붕쉰,붕싄,붕시인,붕신,붕알,붜쥐,붜즈,붜즤,붜지,붱신,붱신지기미씹,붼신,뷃년,뷍시,뷍신,뷔웅신,뷩따,뷩딱,뷩세,뷩쉬,뷩쉰,뷩싄,뷩시,뷩신,뷰쉰,뷰웅시나,뷰웅신,븅,븅따,븅딱,븅띤,븅새끼,븅쉰,븅싀,븅싄,븅시,븅시나,븅신,븅신새끼,븅신색끼,븅신색히,븅신섹히,븅아,브라,브라알,브라자,브랄,브럴,블알,븡딱,븡삼,븡신,븡알,븨융신,븬신,븽쉼,븽싄,븽싐,븽시,븽신,븽씐,비거,비러머글,비러먹을,비융시인,비응신,비잉,비잉시이,비잉신,비참,비칞년,빌어먹을,빙따,빙딱,빙띠,빙띤,빙삼,빙샤,빙쉬,빙쉰,빙쉲,빙슄,빙슄샋뀌,빙슄샋끼,빙싀,빙싄,빙싏,빙싕,빙시,빙신,빙신쉐리,빙신쉐이,빙신아,빙싫,빙싱,빙쑨,빙쒼,빙씬,빙아,빙이신,빠가,빠구뤼,빠구리,빠구울,빠굴,빠꾸뤼,빠꾸리,빠돌이,빠라,빠라주게,빠라줘,빠순이,빠지다,빠큐,빡도네,빡돈새캬,빡돌아,빡살,빡순이,빡촌,빡큐,빡통,빨아줄게,빨아줄까,빨자좃,빸유,빽보지,빽자지,뺘구리,뻐뀨,뻐르나,뻐르너,뻐르노,뻐지,뻐큐,뻐킹,뻑뀨,뻑유,뻑큐,뻨뀨,뻨유,뻨큐,뼈를갈아마실,뼝신,뼝씬,뽀로노,뽀르나,뽀르너,뽀르노,뽀리다,뽀샤불다,뽀쥐,뽀쥐털,뽀즤,뽀지,뽀큐,뽈노,뽈로노,뽕알,뽕유,뽜구리,뿌랄,뿌럴,뿔알,뿡신,뿡알,쁑신,삐꾸,삐리,삘라,삥신,사까쉬,사까시,사까치,사깤시,사디스트,사디즘,사앙녀,사앙년,사창가,사카시,사카씨,사타구니,삭바가지,삭박아지,살인,삿깟시,상년,상놈쉑,상뇬,상늠쉑,새까,새꺄,새뀌,새끠,새끼,새대가리,새대갈,새대구빡,새데가리,새데갈,새데구빡,새뤼,새리,새새꺄,새쉐퀴,새지랄에,새캬,새킈,새키,색갸,색걸,색골,색귀,색긔,색기,색꺄,색뀌,색끼,색남,색녀,색녀야,색마,색수,색스,색스테크닉,색스파트너,색쑤,색쓰,색잘하는,색캬,색퀴,색킈,색키,색파트너,색히,샊기,샊끠,샊이,샋꺄,샙때끼,샛귀,샛기,샛뀌,샛킈,생리,생식기,샠캬,샤럽,샤릭,샤앙,샤앙녀,샤앙년,샤앙놈,샵섹갸,샹녀언,샹년,샹녆,샹노마,샹논,샹놈,샹놈의새리,샹놈의쌔리,샹뇬,샹뇮,샹뇽,샹늠,샹늠의새리,샹늠의쌔리,샹팔개년,섀꺄,섀끼,서혜부,성감대,성경험,성관계,성교,성기,성노예,성매매,성범죄자,성병,성상담,성생활,성섹스,성욕구,성인동영상,성인무비,성인비디오,성인사이트,성인상품,성인샵,성인용품,성체위,성체험,성추행,성테크닉,성폭력,성폭행,성행위,세갸,세꺄,세뀌,세끠,세끼,세럽,세리야,세액스,세엑,세캬,세퀴,세키,섹걸,섹골,섹귀,섹기,섹뀌,섹끼,섹남,섹녀,섹뜨,섹마,섹무비,섹보지,섹소리,섹수,섹쉬,섹슈,섹스,섹스노예,섹스테크닉,섹스파트너,섹쑤,섹쓰,섹여같은것,섹잘,섹키,섹티쉬,섹티즌,섹파트너,섹하고,섹하구,섹하자,섹하장,섹할,섹해,섹햐,섹히,섺이,섻키,셋귀,셋기,셋뀌,셐,셰꺄,셱,솈,소음순,솹쉐이,쇄까,쇄끼,쇄이끼,쇄캬,쇅캬,쇅키,쇆끼,쇆키,쇌끠,쇜캬,쇠끼,쇼걸,쇼펜,수간,수벨,수벵,수음,쉐꺄,쉐뀌,쉐끼,쉐라,쉐리,쉐릴,쉐발,쉐벨넘,쉐이,쉐캬,쉐팔,쉐펄년,쉑,쉑끼,쉑스,쉑이,쉑히,쉒,쉓,쉓끼,쉘벌름,쉟끼,쉡알쉐이,쉣,쉬8넘,쉬댕,쉬델,쉬뎅,쉬바,쉬박,쉬발,쉬방,쉬배,쉬배년들,쉬밸,쉬밸년,쉬뱅,쉬벅,쉬벌,쉬벙,쉬벨,쉬벵이,쉬벹,쉬별뇬,쉬봉,쉬봘,쉬봟년,쉬뵬뇬,쉬뵬련,쉬부랄,쉬불,쉬붊,쉬붕,쉬뷀,쉬브랄,쉬브럴,쉬블,쉬빨,쉬뻘,쉬뿔,쉬알,쉬이발,쉬이방,쉬이벌,쉬이불,쉬이붕,쉬이빨,쉬이팔,쉬이펄,쉬이풀,쉬파,쉬팍,쉬팍아,쉬팔,쉬팡,쉬퍅,쉬퍼얼,쉬퍽,쉬펄,쉬퐁,쉬풀,쉬풜,쉭키,쉭히,쉴라,쉻팛,쉽땡구리,쉽바,쉽박,쉽발,쉽벌,쉽빨,쉽뻘,쉽뽫,쉽새,쉽색,쉽샼,쉽세,쉽섹,쉽쇗,쉽쉐,쉽쌔,쉽쌕,쉽쎄,쉽쎅,쉽아,쉽알,쉽얄,쉽쟁이,쉽질,쉽창,쉽탱구리,쉽파,쉽팍,쉽팔,쉽펄,쉽할,쉽헐,쉽활,쉾알,쉿발,쉿벌,쉿빨,쉿뻘,쉿팍,쉿팔,쉿펄,슆파,슈밸,슈ㅣ바,슈ㅣ발,스너프,스바,스발,스밸,스벌,스블,스와핑,스잘,스트립,스팍,스팔,스펄,습알,싀댈,싀델,싀뎅,싀바라,싀박,싀발,싀밸,싀뱔,싀벌,싀벨,싀봉,싀봘,싀파,싀팍,싀팔,싀팤,싀펄,싀퐐,싀퐑,싁키,싑,싑늠,싑새,싑알,싑으럴,싒알늠,싓팛,시8,시까다,시댕,시뎅,시뗑이,시바,시발,시밝,시밣,시방,시배,시밸,시뱅,시뱅년,시뱔,시뱜,시버럴,시벌,시벌존나,시벌좃나,시벨,시벵,시볼,시봉,시봘,시뵐,시부,시부랄,시부랄넘,시부랄녀언,시부랄년,시부랄놈,시부랄뇬,시부래미,시부럴,시부리,시불,시불랑,시불헐,시붏,시붕,시붤,시뷀,시뷜,시뷸,시브랄,시블,시빡,시빨,시뺠,시뿔,시앙년,시양년,시이발,시이벌,시이불,시이붕,시이팔,시이펄,시이풀,시입팔,시키,시탈년,시탈놈,시파,시팍,시팎,시팔,시팟,시팡,시팰,시퍄,시퍅,시퍌,시퍕,시펄,시펠,시폴,시퐁,시퐉,시퐐,시퐑,시풀,식쇗,식팍,식펄년이,신음,신음소리,실밸,싧알,싫팛,심년아,십8,십녀,십년,십뇽,십다발이,십데꺄,십때끼,십땡구리,십땡그리,십땡글이,십떼끼,십물,십발,십버지,십벌,십볼,십부랄,십부럴,십불,십블,십빡,십빨,십뻘,십뽈,십뿔,십쁠,십새,십새리,십색,십샤,십세,십셰리,십쉐,십쌔,십쌔끼,십쌕,십쎄,십쎅,십아,십알,십앓,십얼,십엘,십우랄년아,십으랄년,십을년,십자석,십자슥,십장이,십쟁이,십지랄,십질,십창,십탱,십텡,십파,십팍,십팔,십팡넘아,십퍌,십펄,십퐐,십할,십헐,싯발,싯벌,싯볼,싯빨,싯뻘,싯팔,싯팕,싯팛,싰발,싰벌,싰볼,싰빨,싰뻘,싰뽈,싰팔,싱발,싶까,싶박,싶발,싶벌,싶볼,싶불,싶블,싶빡,싶빨,싶뻘,싶뽈,싶뿔,싶쁠,싶새,싶세,싶쉐,싶쌔,싶쎄,싶알,싶질,싶창,싶팍,싶팔,싶펄,싶할,싶헐,싶활,싸가쥐,싸가지,싸갈,싸과지,싸구지,싸까쉬,싸까시,싸까씨,싸까지,싸까찌,싸넘,싸년,싸놈,싸뇬,싸늠,싸발,싸벌,싸봘,싸앙,싸앙년,싸앙뇬,싸앙뉸,싸이코,싸카시,싸카씨,싹년,싹바가지,싹박아지,싹아쥐,싹아지,싹퉁머리,싺아지,쌉쌕뀌,쌌어,쌍냔,쌍넌,쌍넘,쌍년,쌍녆,쌍노마,쌍놈,쌍뇬,쌍뇽,쌍뉸,쌍늠,쌍보지,쌍부랄,쌍연?,쌍통,쌔기,쌔꺄,쌔끈,쌔끼,쌔뽕,쌔시벨,쌔키,쌕,쌕걸,쌕기,쌕년,쌕수,쌕쉬,쌕스,쌕쌔기,쌕쌕이,쌕쑤,쌕쓰,쌩쇼,쌩쑈,쌩아,쌰다마우쓰,쌰럽,쌰앙,쌰앙녀,쌰앙년,쌰앙뇬,쌰앙뉸,썅,썅넌,썅년,썅뇬?,썅악년,썅악여,썅악연,썅앙년,썅연,썍썈,썎스,써글,써글뇬,써발넘,써벌,썩을,쎄기,쎄꺄,쎄뀌,쎄끈,쎄끼,쎄려,쎄벨,쎄엑,쎄엑스,쎅,쎅기,쎅수,쎅스,쎅쓰,쎅이,쎅히,쎼키,쏴괄,쐉년,쐉뇬,쐐꺄,쐐끼,쑈우망가,쑤댕,쑤발,쑤벌,쑤벨,쑤뷀,쑤뽕,쑤셔,쑤팔,쑤팡,쑤펄,쑵,쒜,쒜끼,쒜이,쒝,쒝스,쒞,쒞끼,쒭,쒭딱,쒯,쒯뽤,쒲,쒸,쒸댕,쒸뎅,쒸바,쒸박,쒸발,쒸방,쒸배,쒸밸넘아,쒸뱅,쒸버,쒸벌,쒸벨,쒸봘,쒸부랄,쒸부럴,쒸불,쒸붕,쒸뷰랄,쒸뷰럴,쒸블,쒸빨,쒸뼬,쒸뿔,쒸알,쒸앙,쒸양,쒸이발,쒸이방,쒸이벌,쒸이불,쒸이붕,쒸이빨,쒸이팔,쒸이펄,쒸이풀,쒸입,쒸파,쒸팍,쒸팔,쒸팡색기,쒸팡색끼,쒸펄,쒸퐉,쒸퐐,쒸퐐넘,쒸퐐놈,쒸풀,쓇알,쓉,쓉새,쓉세,쓉쇗,쓉썌,쓉쎄,쓉쎅,쓉쎼,쓉알,쓉창,쓉탱,쓊알,쓋,쓰글,쓰댕,쓰뎅,쓰렉,쓰리썸,쓰바,쓰바새끼,쓰바할,쓰발,쓰방쉐,쓰밸,쓰버럴,쓰벌,쓰벨,쓰벯,쓰벵,쓰보랄,쓰봉,쓰봉쉐,쓰부랄,쓰불,쓰붕,쓰붕쉐,쓰뷀,쓰브랄,쓰브랄쉽세,쓰블,쓰븡,쓰빌,쓰빨,쓰뻘,쓰알,쓰으발,쓰으벌,쓰으블,쓰으팔,쓰으펄,쓰파,쓰팍,쓰팔,쓰팡,쓰퍽,쓰펄,쓰퐈,쓱을,씁벌,씁새,씁색,씁세,씁쉐,씁쌕,씁쎄,씁쎅,씁쒜,씁아,씁얼,씁창,씁탱,씁헐,씌댈,씌댕,씌바,씌박,씌발,씌방,씌배,씌밸,씌뱅,씌뱔,씌벌,씌벙,씌벨,씌봐랄,씌봘,씌봜,씌불,씌브뢇,씌블,씌비,씌빌,씌빨,씌뻘,씌뽫,씌앙,씌양,씌파,씌팍,씌팔,씌팡,씌펄,씌퐈,씌퐐,씌퐝,씍팛,씕앓,씛알,씛앨,씝,씝창,씞알,씦섺,씦얼,씦펄,씨8,씨가랭넘,씨가랭년,씨가랭놈,씨끼,씨냉,씨다바리,씨달,씨댈,씨댕,씨댕년,씨댕이,씨뎅,씨바,씨바랄,씨바새끼,씨바알,씨박,씨밖,씨발,씨밝,씨밟,씨밠,씨방,씨방새,씨방세,씨방쉐,씨배,씨배랄,씨밸,씨뱅,씨뱅가리,씨뱅이,씨뱔,씨뱡,씨버,씨버럴,씨벌,씨베랄,씨베렐,씨베르,씨벨,씨벨세끼,씨벵,씨벵이,씨보랄,씨보지,씨복,씨볼,씨봉,씨봉알,씨봘,씨봙,씨봙놈,씨봚,씨봟,씨뵬,씨부,씨부댕,씨부랄,씨부랠,씨부럴,씨부렁,씨부롤,씨부리,씨부얼,씨불,씨불알,씨불얼,씨불할,씨불헐,씨붕,씨뷀,씨브,씨브랄,씨브럴,씨브룰,씨블,씨븡새끼,씨비랄,씨빌,씨빠,씨빡,씨빢,씨빨,씨뺄뇬아,씨뺑,씨뺠,씨뽀랄,씨뽁,씨뽈,씨뽕,씨뽝,씨뽤,씨뽫,씨뽱,씨뿔,씨뿡,씨쁠,씨섹끼,씨앙,씨앙년,씨양년,씨이바알,씨이발,씨이방,씨이뱅,씨이벌,씨이불,씨이붕,씨이블,씨이빨,씨이팔,씨이펄,씨이풀,씨입쉐,씨입팔,씨입할,씨창,씨탱,씨텡,씨파,씨팍,씨팔,씨팕,씨팝,씨팡,씨퍌,씨펄,씨펠,씨폴,씨퐁,씨퐈,씨퐉,씨퐝,씨풀,씨풍,씨플,씨할,씨활,씩발,씩팍,씳뿔,씳알,씹,씹8,씹가튼년,씹구멍,씹까,씹년,씹년양아치,씹념이,씹뇬,씹다,씹닥,씹덕,씹덕후,씹딱,씹땡구리,씹땡그리,씹만아,씹만한,씹물,씹미랄,씹발,씹방,씹버지,씹벌,씹보지,씹볼뇬,씹부랄,씹브랄,씹빨,씹빵구,씹뻘,씹뽀지,씹뿔,씹쁠,씹새,씹색,씹샤,씹세,씹세리,씹섹,씹쇇,씹숑,씹쉐,씹쌔,씹쌕,씹썌,씹썎,씹쎄,씹아,씹알,씹앓,씹어,씹얼,씹울,씹울알,씹을,씹을년,씹자석,씹자슥,씹자식,씹자지,씹장이,씹쟁이,씹젖,씹좆,씹좇,씹쥘,씹지랄,씹질,씹창,씹챵,씹탱,씹텡,씹퉁,씹팅,씹팍,씹팔,씹퍼년,씹펄,씹펄년아,씹할,씹헐,씹활,씺알,씻구멍,씻발,씻밸,씻벨,씻볼,씻불,씻빨,씻뻘,씻뽈,씻뿔,씻탱구리,씻팔,씻팡,씻펄,씻펑,씼팔,앂,앂년,앂물,앂빨,아가리,아갈,아갏,아갏텅,아곤,아괄,아괅,아괋,아구,아구리,아구즤,아구창,아굴,아굻,아굻창,아귈,아긇텅,아다,아다라시,아닥,아리랑치기,아비,아쓰팍씨키,아씨발,아씨팔젖같네,안셸,알몸,알툼,암컷,애널,애로,애무,애뮈,애믜,애미,애미좃,애미좆,애뷔,애비,애새끼,애섂끼,애셋꺄,애셋캬,애셋키,애액,애자,애좌,애지랄,앰병,앰뵹,앰빙,앰창,앵년아,앵뇨,앵신새끼,야게임,야겜,야께임,야껨,야담,야리네,야리다,야매,야메,야뱌리,야사,야설,야오이,야테,얍삽한놈,양갈보,양년,양아취,양아치,얨병,어린노무세리,어미,얼간이,엄마먹었당,엄창,에로,에뮈,에미,에비,엑스엑스,엑스터시,엠병,엠창,엥기네,여엄병,여의봉자지,연놈,연병,연뵹,엳빠,열나,열라,염뱅할,염병,염뵹,염불,염졍,엿가툰,엿가튼,엿같,엿같다,엿같은,엿같은년아,엿같이,엿놈,엿머거,엿먹,엿먹어,엿먹어라,엿먹으셈,엿박,엿박어,엿밖어,엿이다,엿질,엿창,엿쳐무라,영자,옂빠,옅같다,옅빠,옘병,옘뵹,옘빙,옘빙헐년,오나니,오라질,오랄,오럴,오럴섹스,오르가슴,오르가즘,오방정,오봉년,오사마,오입,올가즘,옴창,옷벗기기,와레즈,왕가슴,왕버지,왕자지,왕잠지,왕털버지,왕털보지,왕털자지,왕털잠지,요년,요바,욕빨,욘나,욘늬,욘니,욜릐,욜릐재슈,욧가툰,용주골,우라질,운영자,운영진,원나잇,원조교재,원조교제,원조알바,웬수년,웸뵹,유깝,유깦,유두,유륜,유바,유방,유방핧아,유방핧어,유욱갑,육갑,육갚,육구자세,육깝,육깦,육봉,육시럴,육실할,육실헐,육씨랄년,육씨랄놈,윤간,윤락,음경,음낭,음담패설,음란,음렬,음부,음순,음열,음욕,음탕,이년,이뇽,이돌,이쁜이수술,이새까,이새까가,이새꺄,이세꺄,이쇅,이쉐꺄,이쉑,이쉑꺄,이시끼,이시뽷녀,이싯팔,이쌍뇬아,이자식,이텔,임병할,입걸레,입쳐닫어,자궁,자기핧아,자멘,자쉭,자아지,자위,자쥐,자쥐털,자즤,자지,자짓,작은보지,잠지,잠짓물마셔,잡것,잡껏,잡넘,잡년,잡노무,잡놈,잡뇬,잡뇽,잡스러운,잡종,잡종년,쟈지,저까,저까튼,저깐,저꽈,저꽈튼,저꽛튼,저년,저떠,저떠씨벵,저빱,저뽜,저세끼,저쇅,저썌끼,저엇,저엊,적가튼,적까,적꽈튼,전나,전니,전마난,전만아,전만한,젏밥,점물,접밥,젓가,젓가튼,젓갓,젓같,젓같내,젓같네,젓같다,젓같은,젓같은?,젓까,젓꺽쥐,젓꺽지,젓꼭쥐,젓꼭지,젓꽡,젓나,젓냄새,젓니,젓대가리,젓떠,젓또,젓랄,젓마나,젓마난,젓마니,젓마무리,젓만아,젓만이,젓만한게,젓물,젓밥,젓빱,젓빺,젓잡고,젓카,정력,정사,정신병자,정액,정자,젖,젖가,젖가튼,젖같,젖같네,젖같은,젖까,젖까튼,젖깥은,젖꺽쥐,젖꺽지,젖꼭쥐,젖꼭지,젖대가리,젖더,젖도,젖떠,젖또,젖마나,젖만아,젖만이,젖만한,젖밥,젖빱,젖빺,젖잡고,젖탱,젖탱이,젗,젗같,젗까튼,젗잡고,제수없다,젝트,져까,져꽈튼,져더,져떠,져빱,져싯끼,젼나,젿,젿까,젿깐다,졋,졋같다,졎,졎같다,졏,조가튼,조가틍,조같은년,조건만남,조까,조까네,조까라,조까을때,조까지마,조까치,조까튼,조깐냐,조깓,조깟,조깠,조깥,조꽈케,조끗,조끗네,조낸,조또,조랄,조루,조빠,조빠라,조빱,조빺,조뽜,조살할,조쌔리뿔라,조오까,조온나,조옷,조옷가튼,조옷같,조옺,조자,조쟁이,조저,조져버린다,조지,조진다,조질것,조질래,조카툰,조카튼,조팝,족가튼,족가튼넘,족가튼년,족간네,족갓은,족갗,족같,족같내,족같네,족같은,족같이,족까,족까치,족꽈튼,족마니,족밥,족쳐,족치,족치다,족칠,족칠년,졲까,존나,존늬,존니,존마,존마난,존마니,존만,존만새끼,존만아,존만한,존만히,존먹어,졶나,졷,졸같은넘,졸까라,졸라,졸래,졸롸,좀마난,좀마놘,좀마니,좀만한,좀뫄뉘,좀물,좀쓰레기,좁년,좁물,좁밥,좁빠라라,좁빱,좃,좃가튼,좃간년,좃갔다,좃같,좃같내,좃같네,좃같다,좃같아,좃같어,좃같은,좃까,좃깟네,좃깨,좃께,좃나,좃냄새,좃넘,좃니재수야,좃대가리,좃대로,좃도,좃떠,좃또,좃마무리,좃만아,좃만이,좃만한,좃먹어,좃물,좃밥,좃보지,좃봉지,좃부랄,좃빠구리,좃빠네,좃빠라,좃빱,좃빺,좃잡고,좃털,좄,종간나,좆,좆가튼,좆같,좆같네,좆같아,좆까,좆까네,좆까튼,좆깥은,좆꼴려,좆나,좆도,좆또,좆만아,좆만이,좆물,좆밥,좇,좇가튼,좇같,좇같네,좇같은,좇까,좇까튼,좇깥은,좇도,좇밥,좈,좉,좊,좋만한것,좌쉭,좌슥,좌식,좌지,좝것,좨수없다,죄수없다,죠까,죠까틍,죠끄튼,죠됴,죠또,죠랄,죠랄하네,죠자블,죠질짓,죠카태,죠카테,죠카툰,죠콰떼,죠콰태,죠콰테,죠콰퉤,죡,죤,죤나,죧,죧같,죧만한,죨라,죰만한,죱나,죳,죳까,죴,죵,죵나,죵니,죵마난,죶,죶가튼,죶같은,죷,주교,주글년,주글래,주길년,주댕이,주둥아리,주둥이,죽고싶냐,죽구십냐,죽구싶냐,죽을년,죽을놈,죽을래,죽이삔다,죽일년,죽일놈,죽탱이,줘빱,줜마나,줴수없다,쥐뎅이,쥐랄,쥐럴,쥐롤,쥐뢀,쥐룰,쥐뤌,쥐새키,쥐세키,쥐엠,쥐이럴,쥘알,쥬센,쥬퍼,즈랄,즤랄,즤랋,즤럴,즤롤,즬알,지랄,지랠,지럴,지렐,지롤,지뢀,지뢸,지룰,지뤌,지를,지미,지어미,지에미,지엠,지이랄,지이럴,지젠,지져버려,질세정,질수축,질알,질얼,질올,질할,짜바리,짜쥐,짜쥐털,짜즤,짜지,짜지털,짬지,짭새,짭쉐,쨔저,쨔져,쩌가뤼,쩌밥,쩔라,쪼가뤼,쪼가리,쪼가튼,쪼갈,쪼개지마,쪼까,쪼다,쪼말탱이,쪼사,쪽밥,쪽빠리,쫃갇네,쫃같네,쫍밥,쫏까리,쫒까튼,쫓같,쬬개,쬬까,쭀,쭂대,쭈둥아리,쮜랄,쮜져죽일,찌랄,찌랄하네,찌롤,찌찌,찐따,찢어버,찢어죽일년,찢어죽일놈,차앙녀,창남,창녀,창년,창놈,창뇨,창뇬,창여,처녀막,처덜은싯키,처먹어,처먹어라,처뭑은,처박다,처죽일년,처죽일놈,천넘,첫경험,첫더,체모,체위,쳐도랐네,쳐뒈질래,쳐먹그,쳐먹다,쳐먹어,쳐바르다,쳐버리다,쳐쑤셔박어,쳐자빠졌다,쳐죽인다,쳐죽일,쳐죽일것,쳐죽일년,쳐죽일놈,쳐지다,쳤같다,촌나시펄,촌년,촌놈,촹년,촹뇬,최음,쵸도랐나,춎마라라,춎이다,츠발,칀뇬,친넘,칠뇬,카섹,캐병신,캐븅신,캐새끼,캐쉐리,캐쉑끼,캐시,커닐링구스,컴x,컴색,컴세엑,컴섹,컴쌕,컴쎅,코카인,콘돔,콩까,콩까기,콩까다,쿤닐링구스,크리토리스,큰보지,클리토리스,퇴폐,튀껍냐,튀꼽,튀꼽냐,특수년아,티껍,티껍냐,티꼽,티꼽냐,티발,파큐,팔병신,패니스,패티쉬,패티시,팬티,팰라치오,팸쉧키,퍼르노,퍼큐,퍽유,퍽큐,펀섹,펔규,펔뀨,펔유,펔큐,페니스,페미돔,페티걸,페티쉬,페티시,페팅,펠라치오,펠라티오,펨돔,펨섭,폐니스,폐티걸,폐티쉬,폐티시,포경,포까이,포뀨,포로너,포로느,포르나,포르너,포르노,포르로,포온섹,포큐,폭뀨,폰no,폰x,폰색,폰섹,폰쎅,풀알,피넛기집,피임,피터질,필로폰,하얀즵,하얀집갈년,하양집,할타,핥,핥아,함주까,항문,핸타이,허뎝,허러,허로,허뤄,허버리년,허벌,허저비,허접,허좁,허좁섹갸,헐렁보지,헐어섻키,헨타이,헴타이,혀로보지핧기,혀로보지핱기,혀를넣구싶다,혀를집어넣고,현거래,현금거래,호구,호구쉐끼,호냥년,호러,호러세귀,호러잡년,호로,호로몬,호루,호빠,호스테스바,호스트,호스트바,호스트빠,호스티스,호양년,호오로,호좁,호테스바,호테스빠,혼음,화냥,화냥년,화냥뇬,확대기구,환장,회음부,후까시,후다,후라,후라덜넘,후라들년,후래자식,후레,후려,후뢰자식,후리지마,후릴년,후장,후좡,후진년,휠레,흐접쌔끼,그랑몬스터,부즈클럽,우정몬,아둥가,그랑E,그랑Z,그랑V,치도라,치블럭,치람단,꼬끄,고도치,임모치,범상치,민두지,프레두지,반장두지,찐해,짱찐해,개찐해,꼬락,찡꼬락,스타꼬락,고미다,파워고미다,북고미다,빼미,충혈빼미,비포선녀,에프터선녀,수리겐,할로겐,콜라겐,켄타찌찌,켄타뿌우,켄타홀릭,용왕간셔틀,취직간셔틀,이직간셔틀,무너스케,징어스케,잠수스케,이너공주,이너조스,보오이소라,핑오이소라,갈오이소라,숙취후크,만취후크,구공,이대오공,조더니공,꼬진장,노인장,초싸인장,화네이도,삐지네이도,미라,피라미라,부장수리,오공수리,가발수리,트러글타,존트러글타,깡깡피온,찌릿피온,골드스핑,메두스핑,도라스핑,머쿠,윙쿠,빡이,딥빡이,컬희,데빌컬희,락컬희,국희,왕국희,일구,제대일구,단호일구,반죽타이슨,헬스타이슨,비행타이슨,우루스,핑쿠루스,오빠달루스,조르부,칼조르부,펑키조르부,떼구리,철구리,똥구리,뻐드렁,뻐드렁맨,금뻐드렁,배콤,멍배콤,스냅배콤,뉴타운펭,아따펭,구조펭,구구구구,쫄구구구,카우구구구,찌찌오우거,망토오우거,바이킹오우거,빽소시지,소시지부침,타투소시지,닥터끼리,토끼리,로보끼리,초치네,우가,파마우가,코우가,표범원씨,호랑원씨,소룡원씨,스플리더두,레인보우두,마인두,백스트롱,황스트롱,나이찌롱,우주돈,쑥머리돈,번개돈,오형,에이형,에이비형,하쿠,레드하쿠,무사하쿠,건치령,나시야,카리야,삐에야,조카드라,아재드라,할배드라,흐,처녀흐,흐흐흐,뽀올록,뿌울룩,뻐얼럭,혼자니,혼장군,혼보그,콘스탄틴,녹스탄틴,본스탄틴,마왕";

        string[] nameList = BanName.Split( ","[0] );
        for ( int i = 0; i < nameList.Length; i++ )
        {
            if ( _inputTextField.text == nameList[i] )
            {
                UIManager.instance.OpenCheckPopup( E_CHECK_POPUP_TYPE.Confirm, "안내", "부적절한 팀 이름 입니다." );
                return;
            }
        }
        

        WebSender.instance.P_REQUEST_SET_TEAMNAME( _inputTextField.text, SetTeamNameCallBack );

    }

    void SetTeamNameCallBack( JSONObject jsonObj )
    {
        int code = (int)jsonObj["_Code"].n;

        if ( code == (int)common.ResultCode.OK )
        {
            DataManager.instance.netdata.player._TeamName = _inputTextField.text;
            Debug.Log( "Set TeamName : " + _inputTextField.text );
            if ( _callback != null )
            {
                _callback();
            }
            this.transform.gameObject.SetActive( false );
        }
        else if(code == (int)common.ResultCode.INVALID_PARAMETER)
        {
            if (_textString.Length < 2)
            {
                //UIManager.instance.OpenPopup( E_UIPOPUP_TYPE.CheckPopup ).GetComponent<CheckPopup>().SetCheckPopupDesc( E_CHECK_POPUP_TYPE.Confirm, "안내", " 팀 이름이 너무 짧아요!" );
                UIManager.instance.OpenCheckPopup(E_CHECK_POPUP_TYPE.Confirm, E_LOCALIZE_STRING.SYSTEM_MESSAGE_DESC, E_LOCALIZE_STRING.SYSTEM_ALERT_TEAM_NAME_TOOSHORT_DESC);
            }
            else if (_textString.Length > 7)
            {
                //UIManager.instance.OpenPopup(E_UIPOPUP_TYPE.CheckPopup).GetComponent<CheckPopup>().SetCheckPopupDesc(E_CHECK_POPUP_TYPE.Confirm, "안내", " 팀 이름이 너무 길어요!");
                UIManager.instance.OpenCheckPopup(E_CHECK_POPUP_TYPE.Confirm, E_LOCALIZE_STRING.SYSTEM_MESSAGE_DESC, E_LOCALIZE_STRING.SYSTEM_ALERT_TEAM_NAME_TOOLONG_DESC);
            }
        }
        else if ( code == (int)common.ResultCode.ALREADY_EXISTS )
        {

            if ( _textString.Length < 2 )
            {
                //UIManager.instance.OpenPopup( E_UIPOPUP_TYPE.CheckPopup ).GetComponent<CheckPopup>().SetCheckPopupDesc( E_CHECK_POPUP_TYPE.Confirm, "안내", " 팀 이름이 너무 짧아요!" );
                UIManager.instance.OpenCheckPopup( E_CHECK_POPUP_TYPE.Confirm, E_LOCALIZE_STRING.SYSTEM_MESSAGE_DESC, E_LOCALIZE_STRING.SYSTEM_ALERT_TEAM_NAME_TOOSHORT_DESC );
            }
            else if ( _textString.Length > 7 )
            {
                //UIManager.instance.OpenPopup(E_UIPOPUP_TYPE.CheckPopup).GetComponent<CheckPopup>().SetCheckPopupDesc(E_CHECK_POPUP_TYPE.Confirm, "안내", " 팀 이름이 너무 길어요!");
                UIManager.instance.OpenCheckPopup( E_CHECK_POPUP_TYPE.Confirm, E_LOCALIZE_STRING.SYSTEM_MESSAGE_DESC, E_LOCALIZE_STRING.SYSTEM_ALERT_TEAM_NAME_TOOLONG_DESC );
            }
            else
            {
                //UIManager.instance.OpenPopup( E_UIPOPUP_TYPE.CheckPopup ).GetComponent<CheckPopup>().SetCheckPopupDesc( E_CHECK_POPUP_TYPE.Confirm, "안내", " 사용중인 팀이름입니다." );
                UIManager.instance.OpenCheckPopup( E_CHECK_POPUP_TYPE.Confirm, E_LOCALIZE_STRING.SYSTEM_MESSAGE_DESC, E_LOCALIZE_STRING.SYSTEM_ALERT_TEAM_NAME_ALREADY_USE_DESC );
            }
            _inputTextField.text = string.Empty;
            
            if ( null == _keyboard )
                return;

            if ( true == _keyboard.done )
            {
                _keyboard.text = string.Empty;
            }
        }
        else if(code == 98)
        {
            UIManager.instance.OpenCheckPopup( E_CHECK_POPUP_TYPE.Confirm, "안내" , "부적절한 팀 이름 입니다." );
        }
    }


}
